
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/ae3a9cd0-dd64-4026-8a4c-58f005534656/terraform-bin plan -no-color
2024-05-21T16:58:15.766Z [INFO]  Terraform version: 1.8.1
2024-05-21T16:58:15.766Z [INFO]  Go runtime version: go1.22.1
2024-05-21T16:58:15.766Z [INFO]  CLI args: []string{"/home/runner/work/_temp/ae3a9cd0-dd64-4026-8a4c-58f005534656/terraform-bin", "plan", "-no-color"}
2024-05-21T16:58:15.766Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-21T16:58:15.772Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=d0a8b95f-8939-7216-2092-6dffc40e0143 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-21T16:58:16.529Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d0a8b95f-8939-7216-2092-6dffc40e0143 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-21T16:58:16.711Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d0a8b95f-8939-7216-2092-6dffc40e0143 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-21T16:58:17.050Z [INFO]  backend/local: starting Plan operation
2024-05-21T16:58:17.712Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=f6d21745-5568-0a53-bf54-2a1850a6ad64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-21T16:58:18.262Z [INFO]  provider: configuring client automatic mTLS
2024-05-21T16:58:18.355Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:58:18.355Z
2024-05-21T16:58:19.015Z [INFO]  provider: configuring client automatic mTLS
2024-05-21T16:58:19.104Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:58:19.103Z
2024-05-21T16:58:19.225Z [INFO]  backend/local: plan calling Plan
2024-05-21T16:58:19.229Z [INFO]  provider: configuring client automatic mTLS
2024-05-21T16:58:19.318Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:58:19.318Z
2024-05-21T16:58:19.426Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=603771ab-e885-7c4f-0521-5a83f18a45ef timestamp=2024-05-21T16:58:19.426Z
2024-05-21T16:58:20.190Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_req_id=603771ab-e885-7c4f-0521-5a83f18a45ef tf_rpc=ConfigureProvider tf_provider_addr=registry.terraform.io/hashicorp/aws @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 timestamp=2024-05-21T16:58:20.190Z
aws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]
data.aws_ami.ubuntu: Reading...
aws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]
aws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]
aws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]
aws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-00c0a6b6c9e473ec0]
2024-05-21T16:58:20.203Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_out_rule, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
      - .force_destroy: planned value cty.False for a non-computed attribute
2024-05-21T16:58:20.203Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_in_rule, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
      - .force_destroy: planned value cty.False for a non-computed attribute
2024-05-21T16:58:20.445Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-21T16:58:20.447Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.rds_management_policy, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
2024-05-21T16:58:20.448Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-21T16:58:20.450Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.asg_management_policy, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
2024-05-21T16:58:20.489Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.
      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan
      - .managed_policy_arns: length changed from 1 to 2
2024-05-21T16:58:20.491Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.lambda_role, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
aws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]
aws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]
2024-05-21T16:58:20.498Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_out_lambda, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .publish: planned value cty.False for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-21T16:58:20.498Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_in_lambda, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .publish: planned value cty.False for a non-computed attribute
      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute
      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute
      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .skip_destroy: planned value cty.False for a non-computed attribute
      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-21T16:58:20.501Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_out_target, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
2024-05-21T16:58:20.502Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_in_target, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute
2024-05-21T16:58:21.069Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2024-05-21T16:58:21.258Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2024-05-21T16:58:21.260Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)
      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)
data.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]
aws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]
2024-05-21T16:58:21.885Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.
      - .security_group_names: was null, but now cty.SetValEmpty(cty.String)
2024-05-21T16:58:21.893Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .user_data: planned value cty.StringVal("") for a non-computed attribute
      - .disable_api_stop: planned value cty.False for a non-computed attribute
      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute
      - .disable_api_termination: planned value cty.False for a non-computed attribute
      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute
      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute
      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute
aws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]
2024-05-21T16:58:22.689Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.
      - .enabled_metrics: was null, but now cty.SetValEmpty(cty.String)
      - .suspended_processes: was null, but now cty.SetValEmpty(cty.String)
      - .termination_policies: was null, but now cty.ListValEmpty(cty.String)
2024-05-21T16:58:22.697Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .context: planned value cty.StringVal("") for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .placement_group: planned value cty.StringVal("") for a non-computed attribute
      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .capacity_rebalance: planned value cty.False for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .force_delete: planned value cty.False for a non-computed attribute
      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
2024-05-21T16:58:22.724Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.scale_in_rule will be created
  + resource "aws_cloudwatch_event_rule" "scale_in_rule" {
      + arn            = (known after apply)
      + description    = "Event bridge scale-in lambda"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail    = {
                  + Action               = [
                      + "stop",
                    ]
                  + AutoScalingGroupName = [
                      + "algosolved-ec2-asg",
                    ]
                  + DesiredCapacity      = [
                      + 0,
                    ]
                }
              + resources = [
                  + "arn:aws:rds:us-west-2:123456789012:db:algosolved-rds",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "scale-in-rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_rule.scale_out_rule will be created
  + resource "aws_cloudwatch_event_rule" "scale_out_rule" {
      + arn            = (known after apply)
      + description    = "Event bridge scale-out lambda"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail    = {
                  + Action               = [
                      + "start",
                    ]
                  + AutoScalingGroupName = [
                      + "algosolved-ec2-asg",
                    ]
                  + DesiredCapacity      = [
                      + 1,
                    ]
                }
              + resources = [
                  + "arn:aws:rds:us-west-2:123456789012:db:algosolved-rds",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "scale-out-rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.scale_in_target will be created
  + resource "aws_cloudwatch_event_target" "scale_in_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "scale-in-rule"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.scale_out_target will be created
  + resource "aws_cloudwatch_event_target" "scale_out_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "scale-out-rule"
      + target_id      = (known after apply)
    }

  # aws_ecr_repository.algosolved_repository will be updated in-place
  ~ resource "aws_ecr_repository" "algosolved_repository" {
        id                   = "algosolved-ecr"
        name                 = "algosolved-ecr"
        tags                 = {}
      ~ tags_all             = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.asg_management_policy will be updated in-place
  ~ resource "aws_iam_policy" "asg_management_policy" {
        id               = "arn:aws:iam::471112990651:policy/autoscaling-management-policy"
        name             = "autoscaling-management-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "autoscaling:UpdateAutoScalingGroup" -> [
                          + "autoscaling: UpdateAutoScalingGroup",
                        ]
                      - Effect   = "Allow"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.rds_management_policy will be updated in-place
  ~ resource "aws_iam_policy" "rds_management_policy" {
        id               = "arn:aws:iam::471112990651:policy/rds-management-policy"
        name             = "rds-management-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          ~ "rds:DescribeDBInstances" -> "rds: StartDBInstance",
                            "rds: StopDBInstance",
                          ~ "rds: StartDBInstance" -> "rds: DescribeDBInstances",
                        ]
                      - Effect   = "Allow"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.scale_in_lambda will be created
  + resource "aws_lambda_function" "scale_in_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./scale_in/lambda_function.py.zip"
      + function_name                  = "scale_in_lambda"
      + handler                        = "lambda_function.py.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "hIFF6Y5p8OxB0tNRqfEIV5/u4UJfXIWBakhwZ9WBO4I="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"     = "lambda_function.py"
          + "Project"  = "algosolved"
          + "Resource" = "lambda"
          + "Stage"    = "prod"
        }
      + tags_all                       = {
          + "Name"     = "lambda_function.py"
          + "Project"  = "algosolved"
          + "Resource" = "lambda"
          + "Stage"    = "prod"
        }
      + timeout                        = 600
      + version                        = (known after apply)
    }

  # aws_lambda_function.scale_out_lambda will be created
  + resource "aws_lambda_function" "scale_out_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./scale_out/lambda_function.py.zip"
      + function_name                  = "scale_out_lambda"
      + handler                        = "lambda_function.py.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "SLTfgMu1y6G9yLPG4uTmJ/meXZ/vvejHGFJQolCVspY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name"     = "lambda_function.py"
          + "Project"  = "algosolved"
          + "Resource" = "lambda"
          + "Stage"    = "prod"
        }
      + tags_all                       = {
          + "Name"     = "lambda_function.py"
          + "Project"  = "algosolved"
          + "Resource" = "lambda"
          + "Stage"    = "prod"
        }
      + timeout                        = 600
      + version                        = (known after apply)
    }

  # aws_lambda_permission.scale_in_lambda_perm will be created
  + resource "aws_lambda_permission" "scale_in_lambda_perm" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "scale_in_lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.scale_out_lambda_perm will be created
  + resource "aws_lambda_permission" "scale_out_lambda_perm" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "scale_out_lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 8 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: aws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]%0Adata.aws_ami.ubuntu: Reading...%0Aaws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]%0Aaws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]%0Aaws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]%0Aaws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-00c0a6b6c9e473ec0]%0Aaws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]%0Aaws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]%0Adata.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]%0Aaws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]%0Aaws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudwatch_event_rule.scale_in_rule will be created%0A  + resource "aws_cloudwatch_event_rule" "scale_in_rule" {%0A      + arn            = (known after apply)%0A      + description    = "Event bridge scale-in lambda"%0A      + event_bus_name = "default"%0A      + event_pattern  = jsonencode(%0A            {%0A              + detail    = {%0A                  + Action               = [%0A                      + "stop",%0A                    ]%0A                  + AutoScalingGroupName = [%0A                      + "algosolved-ec2-asg",%0A                    ]%0A                  + DesiredCapacity      = [%0A                      + 0,%0A                    ]%0A                }%0A              + resources = [%0A                  + "arn:aws:rds:us-west-2:123456789012:db:algosolved-rds",%0A                ]%0A            }%0A        )%0A      + force_destroy  = false%0A      + id             = (known after apply)%0A      + name           = "scale-in-rule"%0A      + name_prefix    = (known after apply)%0A      + tags_all       = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_event_rule.scale_out_rule will be created%0A  + resource "aws_cloudwatch_event_rule" "scale_out_rule" {%0A      + arn            = (known after apply)%0A      + description    = "Event bridge scale-out lambda"%0A      + event_bus_name = "default"%0A      + event_pattern  = jsonencode(%0A            {%0A              + detail    = {%0A                  + Action               = [%0A                      + "start",%0A                    ]%0A                  + AutoScalingGroupName = [%0A                      + "algosolved-ec2-asg",%0A                    ]%0A                  + DesiredCapacity      = [%0A                      + 1,%0A                    ]%0A                }%0A              + resources = [%0A                  + "arn:aws:rds:us-west-2:123456789012:db:algosolved-rds",%0A                ]%0A            }%0A        )%0A      + force_destroy  = false%0A      + id             = (known after apply)%0A      + name           = "scale-out-rule"%0A      + name_prefix    = (known after apply)%0A      + tags_all       = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_event_target.scale_in_target will be created%0A  + resource "aws_cloudwatch_event_target" "scale_in_target" {%0A      + arn            = (known after apply)%0A      + event_bus_name = "default"%0A      + id             = (known after apply)%0A      + rule           = "scale-in-rule"%0A      + target_id      = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_event_target.scale_out_target will be created%0A  + resource "aws_cloudwatch_event_target" "scale_out_target" {%0A      + arn            = (known after apply)%0A      + event_bus_name = "default"%0A      + id             = (known after apply)%0A      + rule           = "scale-out-rule"%0A      + target_id      = (known after apply)%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be updated in-place%0A  ~ resource "aws_ecr_repository" "algosolved_repository" {%0A        id                   = "algosolved-ecr"%0A        name                 = "algosolved-ecr"%0A        tags                 = {}%0A      ~ tags_all             = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_iam_policy.asg_management_policy will be updated in-place%0A  ~ resource "aws_iam_policy" "asg_management_policy" {%0A        id               = "arn:aws:iam::471112990651:policy/autoscaling-management-policy"%0A        name             = "autoscaling-management-policy"%0A      ~ policy           = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Action   = "autoscaling:UpdateAutoScalingGroup" -> [%0A                          + "autoscaling: UpdateAutoScalingGroup",%0A                        ]%0A                      - Effect   = "Allow"%0A                        # (1 unchanged attribute hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        tags             = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_policy.rds_management_policy will be updated in-place%0A  ~ resource "aws_iam_policy" "rds_management_policy" {%0A        id               = "arn:aws:iam::471112990651:policy/rds-management-policy"%0A        name             = "rds-management-policy"%0A      ~ policy           = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Action   = [%0A                          ~ "rds:DescribeDBInstances" -> "rds: StartDBInstance",%0A                            "rds: StopDBInstance",%0A                          ~ "rds: StartDBInstance" -> "rds: DescribeDBInstances",%0A                        ]%0A                      - Effect   = "Allow"%0A                        # (1 unchanged attribute hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        tags             = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # aws_lambda_function.scale_in_lambda will be created%0A  + resource "aws_lambda_function" "scale_in_lambda" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + filename                       = "./scale_in/lambda_function.py.zip"%0A      + function_name                  = "scale_in_lambda"%0A      + handler                        = "lambda_function.py.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = false%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"%0A      + runtime                        = "python3.12"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = "hIFF6Y5p8OxB0tNRqfEIV5/u4UJfXIWBakhwZ9WBO4I="%0A      + source_code_size               = (known after apply)%0A      + tags                           = {%0A          + "Name"     = "lambda_function.py"%0A          + "Project"  = "algosolved"%0A          + "Resource" = "lambda"%0A          + "Stage"    = "prod"%0A        }%0A      + tags_all                       = {%0A          + "Name"     = "lambda_function.py"%0A          + "Project"  = "algosolved"%0A          + "Resource" = "lambda"%0A          + "Stage"    = "prod"%0A        }%0A      + timeout                        = 600%0A      + version                        = (known after apply)%0A    }%0A%0A  # aws_lambda_function.scale_out_lambda will be created%0A  + resource "aws_lambda_function" "scale_out_lambda" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + filename                       = "./scale_out/lambda_function.py.zip"%0A      + function_name                  = "scale_out_lambda"%0A      + handler                        = "lambda_function.py.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = false%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = "arn:aws:iam::471112990651:role/algosolved-lambda-role"%0A      + runtime                        = "python3.12"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = "SLTfgMu1y6G9yLPG4uTmJ/meXZ/vvejHGFJQolCVspY="%0A      + source_code_size               = (known after apply)%0A      + tags                           = {%0A          + "Name"     = "lambda_function.py"%0A          + "Project"  = "algosolved"%0A          + "Resource" = "lambda"%0A          + "Stage"    = "prod"%0A        }%0A      + tags_all                       = {%0A          + "Name"     = "lambda_function.py"%0A          + "Project"  = "algosolved"%0A          + "Resource" = "lambda"%0A          + "Stage"    = "prod"%0A        }%0A      + timeout                        = 600%0A      + version                        = (known after apply)%0A    }%0A%0A  # aws_lambda_permission.scale_in_lambda_perm will be created%0A  + resource "aws_lambda_permission" "scale_in_lambda_perm" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "scale_in_lambda"%0A      + id                  = (known after apply)%0A      + principal           = "events.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # aws_lambda_permission.scale_out_lambda_perm will be created%0A  + resource "aws_lambda_permission" "scale_out_lambda_perm" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "scale_out_lambda"%0A      + id                  = (known after apply)%0A      + principal           = "events.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0APlan: 8 to add, 3 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-21T16:58:15.766Z [INFO]  Terraform version: 1.8.1%0A2024-05-21T16:58:15.766Z [INFO]  Go runtime version: go1.22.1%0A2024-05-21T16:58:15.766Z [INFO]  CLI args: []string{"/home/runner/work/_temp/ae3a9cd0-dd64-4026-8a4c-58f005534656/terraform-bin", "plan", "-no-color"}%0A2024-05-21T16:58:15.766Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-21T16:58:15.772Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=d0a8b95f-8939-7216-2092-6dffc40e0143 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-21T16:58:16.529Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d0a8b95f-8939-7216-2092-6dffc40e0143 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-21T16:58:16.711Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d0a8b95f-8939-7216-2092-6dffc40e0143 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-21T16:58:17.050Z [INFO]  backend/local: starting Plan operation%0A2024-05-21T16:58:17.712Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=f6d21745-5568-0a53-bf54-2a1850a6ad64 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-21T16:58:18.262Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-21T16:58:18.355Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:58:18.355Z%0A2024-05-21T16:58:19.015Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-21T16:58:19.104Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:58:19.103Z%0A2024-05-21T16:58:19.225Z [INFO]  backend/local: plan calling Plan%0A2024-05-21T16:58:19.229Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-21T16:58:19.318Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:58:19.318Z%0A2024-05-21T16:58:19.426Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=603771ab-e885-7c4f-0521-5a83f18a45ef timestamp=2024-05-21T16:58:19.426Z%0A2024-05-21T16:58:20.190Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_req_id=603771ab-e885-7c4f-0521-5a83f18a45ef tf_rpc=ConfigureProvider tf_provider_addr=registry.terraform.io/hashicorp/aws @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 timestamp=2024-05-21T16:58:20.190Z%0A2024-05-21T16:58:20.203Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_out_rule, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A      - .force_destroy: planned value cty.False for a non-computed attribute%0A2024-05-21T16:58:20.203Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_rule.scale_in_rule, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A      - .force_destroy: planned value cty.False for a non-computed attribute%0A2024-05-21T16:58:20.445Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-21T16:58:20.447Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.rds_management_policy, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A2024-05-21T16:58:20.448Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-21T16:58:20.450Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_policy.asg_management_policy, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A2024-05-21T16:58:20.489Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.%0A      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan%0A      - .managed_policy_arns: length changed from 1 to 2%0A2024-05-21T16:58:20.491Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.lambda_role, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .permissions_boundary: planned value cty.StringVal("") for a non-computed attribute%0A      - .force_detach_policies: planned value cty.False for a non-computed attribute%0A      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .description: planned value cty.StringVal("") for a non-computed attribute%0A      - .path: planned value cty.StringVal("/") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A2024-05-21T16:58:20.498Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_out_lambda, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .publish: planned value cty.False for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-21T16:58:20.498Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lambda_function.scale_in_lambda, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .publish: planned value cty.False for a non-computed attribute%0A      - .memory_size: planned value cty.NumberIntVal(128) for a non-computed attribute%0A      - .package_type: planned value cty.StringVal("Zip") for a non-computed attribute%0A      - .reserved_concurrent_executions: planned value cty.NumberIntVal(-1) for a non-computed attribute%0A      - .skip_destroy: planned value cty.False for a non-computed attribute%0A      - .ephemeral_storage: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .logging_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .tracing_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-21T16:58:20.501Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_out_target, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A2024-05-21T16:58:20.502Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_cloudwatch_event_target.scale_in_target, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .event_bus_name: planned value cty.StringVal("default") for a non-computed attribute%0A2024-05-21T16:58:21.069Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-21T16:58:21.258Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-21T16:58:21.260Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)%0A      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)%0A2024-05-21T16:58:21.885Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.%0A      - .security_group_names: was null, but now cty.SetValEmpty(cty.String)%0A2024-05-21T16:58:21.893Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .user_data: planned value cty.StringVal("") for a non-computed attribute%0A      - .disable_api_stop: planned value cty.False for a non-computed attribute%0A      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .disable_api_termination: planned value cty.False for a non-computed attribute%0A      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute%0A      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-21T16:58:22.689Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.%0A      - .enabled_metrics: was null, but now cty.SetValEmpty(cty.String)%0A      - .suspended_processes: was null, but now cty.SetValEmpty(cty.String)%0A      - .termination_policies: was null, but now cty.ListValEmpty(cty.String)%0A2024-05-21T16:58:22.697Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .context: planned value cty.StringVal("") for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .placement_group: planned value cty.StringVal("") for a non-computed attribute%0A      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .capacity_rebalance: planned value cty.False for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A2024-05-21T16:58:22.724Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @mmmtobezip**